public/reading/mauro-corona/mauro-corona.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/simple.css" />
<meta property="og:title" content="Giovanni's Diary">
<meta property="og:description" content="Diary of Giovanni's adventures.">
<meta property="og:image" content="https://giovanni-diary.netlify.app/logo.png">
<meta property="og:url" content="https://giovanni-diary.netlify.app/">
</head>
<body>
<div id="content" class="content">
<p>
<a href="../../index.html">Giovanni's Diary</a> &gt; <a href="../reading.html">Reading</a> &gt;
</p>

<div id="outline-container-org7971ade" class="outline-2">
<h2 id="org7971ade">Mauro Corona</h2>
<div class="outline-text-2" id="text-org7971ade">
<p>
Mauro Corona is an Italian wood carver who lived much of his life
within <b><b>mountains</b></b> and rural mountain villages. Unsurprisingly, he
writes about that as well.
</p>

<p>
He has a deep love for mountain life, which fascinates me very
much. His books reflect his raw experience in this world, nothing
more than this but It is everything.
</p>

<p>
I am reading many of his books, some of my thoughts are accessible
in the following documents:
</p>

<ul class="org-ul">
<li><a href="mauro-corona-la-casa-dei-sette-ponti.html">La casa dei sette ponti</a></li>
<li><a href="mauro-corona-lunario-sentimentale.html">Lunario Sentimentale</a></li>
<li><a href="mauro-corona-le-voci-del-bosco.html">Le voci del bosco</a></li>
<li><a href="mauro-corona-la-via-del-sole.html">La via del sole</a></li>
<li><a href="mauro-corona-vayont-quelli-del-dopo.html">Vajont: Quelli del dopo</a></li>
</ul>

<hr />

<p>
Travel: <a href="../reading.html">Reading</a>, <a href="../../theindex.html">Index</a>
</p>
</div>
</div>
</div>
</body>
</html>
